2D/exp6/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
backgroundMesh

convertToMeters 1;

vertices  //0
(
    (0 0 0.5)         //0  
    (50 0 0.5)   //1
    (50 0 1)    //2
    (50 0 4)    //3
    (50 0 8)    //4
    (0 0 8)       //5
    (0 0 4)       //6
    (0 0 1)       //7

    (0 -0.1 0.5)         //8  
    (50 -0.1 0.5)   //9
    (50 -0.1 1)    //10
    (50 -0.1 4)    //11
    (50 -0.1 8)    //12
    (0 -0.1 8)       //13
    (0 -0.1 4)       //14
    (0 -0.1 1)       //15
);
 
blocks
(   
hex (0 1 2 7 8 9 10 15)  (1000 10 1) simpleGrading (1 1 1) 
hex (7 2 3 6 15 10 11 14) (1000 60 1) simpleGrading (1 1 1)
hex (6 3 4 5 14 11 12 13) (1000 80 1) simpleGrading (1 1 1)

);


// * * * * * ** * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *  * * * //

edges
(

);

boundary
(
   inlet_water
   {
         type patch;
         faces
         (
              (0 7 15 8)

         );
   }   

   inlet_air
   {
         type patch;
         faces
         (
              (7 6 14 15)
              (6 5 13 14)

         );
   }  

   outlet_water
   {
         type patch;
         faces
         (
              (9 10 2 1)
              (10 11 3 2)
         );
   }

   outlet_air
   {
         type patch;
         faces
         (
              (11 12 4 3)
         );
   }

   atmosphere
   {
         type patch;
         faces
         (
              (4 12 13 5)

         );
   }  

   walls
   {
         type wall;
         faces
         (
              (0 8 9 1)

         );
   }  

   front
   {
         type empty;
         faces
         (
              (0 1 2 7)
              (7 2 3 6)
              (6 3 4 5)
         );
   }  

   back
   {
         type empty;
         faces
         (
              (8 15 10 9)
              (14 13 12 11)
              (15 14 11 10)

         );
   }  
);

mergePatchPairs
(
);

// ************************************************************************* //
